-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: fc_java
-- ------------------------------------------------------
-- Server version	8.0.36-2ubuntu3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `game`
--

DROP TABLE IF EXISTS `game`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `game` (
  `game_num` int NOT NULL AUTO_INCREMENT,
  `game_name` varchar(100) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NOT NULL,
  `game_type` int NOT NULL,
  `game_place` varchar(45) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin NOT NULL,
  `game_img` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_bin DEFAULT NULL,
  `game_memo` text CHARACTER SET utf8mb3 COLLATE utf8mb3_bin,
  `game_subst_date` datetime NOT NULL,
  `game_subfn_date` datetime NOT NULL,
  `game_st_date` datetime NOT NULL,
  `game_fn_date` datetime NOT NULL,
  PRIMARY KEY (`game_num`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_bin;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `game`
--

LOCK TABLES `game` WRITE;
/*!40000 ALTER TABLE `game` DISABLE KEYS */;
INSERT INTO `game` VALUES (1,'제4회 서울체육대회',4,'잠실 종합운동장',NULL,NULL,'2024-03-20 12:00:00','2024-03-25 17:36:59','2024-03-27 14:20:00','2024-03-29 18:00:00'),(2,'제40회 서울체육대회',32,'반포 종합운동장',NULL,'많은 참여 바람','2024-03-25 18:00:00','2024-03-30 22:00:00','2024-04-01 10:20:00','2024-04-05 19:30:00'),(3,'2023 서울특별시축구협회장배 축구대회',4,'서울 월드컵 경기장',NULL,'FIFA 월드컵은 매년 열리는 국제 축구 대회입니다.','2024-03-26 15:30:00','2024-03-26 18:00:00','2024-03-27 10:00:00','2024-03-27 12:00:00'),(4,'2023 서울특별시축구협회장배 축구대회',8,'효창운동장',NULL,'UEFA 유로파 리그는 유럽의 클럽 간 축구 대회입니다.','2024-03-26 16:00:00','2024-03-26 19:00:00','2024-03-27 11:00:00','2024-03-27 13:00:00'),(5,'2023 수원축구협회장배 축구대회',16,'수원 월드컵 경기장 1',NULL,'UEFA 챔피언스 리그는 유럽의 최고 클럽 간의 축구 대회입니다.','2024-03-26 17:00:00','2024-03-26 20:00:00','2024-03-27 12:00:00','2024-03-27 14:00:00'),(6,'2023년 제104회 전국체육대회',32,'수원 월드컵 경기장 2 ',NULL,'프리미어 리그는 잉글랜드의 최상위 축구 리그입니다.','2024-03-26 18:00:00','2024-03-26 21:00:00','2024-03-27 13:00:00','2024-03-27 15:00:00'),(7,'제52회 전국체육대회',4,'백운포체육공원(인조축구장1)',NULL,'라 리가는 스페인의 최상위 축구 리그입니다.','2024-03-26 19:00:00','2024-03-26 22:00:00','2024-03-27 14:00:00','2024-03-27 16:00:00'),(8,'제40회 서울체육대회',8,'백운포체육공원(인조축구장2)',NULL,'분데스리가는 독일의 최상위 축구 리그입니다.','2024-03-26 20:00:00','2024-03-26 23:00:00','2024-03-27 15:00:00','2024-03-27 17:00:00'),(9,'2022 서울특별시축구협회장배 축구대회',16,'신호공원 인조잔디운동장',NULL,'세리에 A는 이탈리아의 최상위 축구 리그입니다.','2024-03-26 21:00:00','2024-03-27 00:00:00','2024-03-27 16:00:00','2024-03-27 18:00:00'),(10,'2022 서울특별시축구협회장배 축구대회',32,'글로벌교육센터 잔디구장',NULL,'리그 앙은 프랑스의 최상위 축구 리그입니다.','2024-03-26 22:00:00','2024-03-27 01:00:00','2024-03-27 17:00:00','2024-03-27 19:00:00'),(11,'제51회 전국소년체육대회',4,'잠실 종합운동장',NULL,'프라임리그는 브라질의 최상위 축구 리그입니다.','2024-03-26 23:00:00','2024-03-27 02:00:00','2024-03-27 18:00:00','2024-03-27 23:00:00'),(12,'2019 서울특별시축구협회장배축구대회',8,'반포 종합운동장',NULL,'프리메라 리그는 스페인의 두 번째 축구 리그입니다.','2024-03-27 00:00:00','2024-03-27 03:00:00','2024-03-27 19:00:00','2024-03-27 21:00:00'),(13,'2019 서울특별시축구협회장배축구대회',4,'서울 월드컵 경기장',NULL,'4인 팀으로 진행되는 축구 대회입니다.','2024-04-01 09:00:00','2024-04-10 18:00:00','2024-04-20 09:00:00','2024-04-25 18:00:00'),(14,'2019 서울특별시축구협회장배축구대회',8,'효창운동장',NULL,'8인 팀으로 진행되는 축구 대회입니다.','2024-04-02 09:00:00','2024-04-11 18:00:00','2024-04-21 09:00:00','2024-04-26 18:00:00'),(15,'2019 서울특별시축구협회장배축구대회',16,'수원 월드컵 경기장 1',NULL,'16인 팀으로 진행되는 축구 대회입니다.','2024-04-03 09:00:00','2024-04-12 18:00:00','2024-04-22 09:00:00','2024-04-27 18:00:00'),(16,'100회 전국체전 서울특별시 축구경기',32,'수원 월드컵 경기장 2 ',NULL,'32인 팀으로 진행되는 축구 대회입니다.','2024-04-04 09:00:00','2024-04-13 18:00:00','2024-04-23 09:00:00','2024-04-28 18:00:00'),(17,'2018 한일 교류 U-12 축구대회',4,'백운포체육공원(인조축구장1)',NULL,'4인 팀으로 진행되는 축구 대회입니다.','2024-04-05 09:00:00','2024-04-14 18:00:00','2024-04-24 09:00:00','2024-04-29 18:00:00'),(18,'2018 동경 U-14 국제청소년축구대회',8,'백운포체육공원(인조축구장2)',NULL,'8인 팀으로 진행되는 축구 대회입니다.','2024-04-06 09:00:00','2024-04-15 18:00:00','2024-04-25 09:00:00','2024-04-30 18:00:00'),(19,'제33회 서울특별시장기축구대회',16,'신호공원 인조잔디운동장',NULL,'16인 팀으로 진행되는 축구 대회입니다.','2024-05-07 09:00:00','2024-05-16 18:00:00','2024-05-17 09:00:00','2024-05-22 18:00:00'),(20,'제44회 서울체육대회',32,'글로벌교육센터 잔디구장',NULL,'32인 팀으로 진행되는 축구 대회입니다.','2024-05-08 09:00:00','2024-05-17 18:00:00','2024-05-18 09:00:00','2024-05-23 18:00:00'),(21,'제33회 서울특별시장기축구대회',4,'잠실 종합운동장',NULL,'4인 팀으로 진행되는 축구 대회입니다.','2024-05-09 09:00:00','2024-05-18 18:00:00','2024-05-19 09:00:00','2024-05-24 18:00:00'),(22,'2017년 서울특별시장기축구대회',8,'반포 종합운동장',NULL,'8인 팀으로 진행되는 축구 대회입니다.','2024-05-10 09:00:00','2024-05-19 18:00:00','2024-05-20 09:00:00','2024-05-25 18:00:00'),(23,'제45회 서울체육대회',16,'서울 월드컵 경기장',NULL,'16인 팀으로 진행되는 축구 대회입니다.','2024-05-11 09:00:00','2024-05-20 18:00:00','2024-05-21 09:00:00','2024-06-05 18:00:00'),(24,'제34회 서울특별시장기축구대회',32,'효창운동장',NULL,'32인 팀으로 진행되는 축구 대회입니다.','2024-05-12 09:00:00','2024-05-19 18:00:00','2024-05-20 09:00:00','2024-06-06 18:00:00'),(25,'제46회 서울체육대회',4,'수원 월드컵 경기장 1',NULL,'4인 팀으로 진행되는 축구 대회입니다.','2024-05-13 09:00:00','2024-05-22 12:00:00','2024-06-02 09:00:00','2024-06-07 18:00:00'),(26,'2024년 서울특별시장기축구대회',8,'수원 월드컵 경기장 2 ',NULL,'8인 팀으로 진행되는 축구 대회입니다.','2024-05-14 09:00:00','2024-05-23 18:00:00','2024-06-03 09:00:00','2024-06-08 18:00:00'),(27,'제36회 서울특별시장기축구대회',16,'백운포체육공원(인조축구장1)',NULL,'16인 팀으로 진행되는 축구 대회입니다.','2024-05-15 09:00:00','2024-05-24 18:00:00','2024-06-04 09:00:00','2024-06-09 18:00:00'),(28,'제37회 서울특별시장기축구대회',32,'백운포체육공원(인조축구장2)',NULL,'32인 팀으로 진행되는 축구 대회입니다.','2024-05-16 09:00:00','2024-05-25 18:00:00','2024-06-05 09:00:00','2024-06-08 18:00:00'),(29,'제38회 서울특별시장기축구대회',4,'신호공원 인조잔디운동장',NULL,'4인 팀으로 진행되는 축구 대회입니다.','2024-05-17 09:00:00','2024-05-26 18:00:00','2024-06-06 09:00:00','2024-06-11 18:00:00'),(30,'2024 서울특별시축구협회장배 축구대회',8,'글로벌교육센터 잔디구장',NULL,'8인 팀으로 진행되는 축구 대회입니다.','2024-05-18 09:00:00','2024-05-27 18:00:00','2024-06-07 09:00:00','2024-06-12 18:00:00');
/*!40000 ALTER TABLE `game` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-06-07  0:25:55
